## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_dns_zone.games_ruut must be replaced
-/+ resource "azurerm_dns_zone" "games_ruut" {
      ~ id                        = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/cs2-servers/providers/Microsoft.Network/dnsZones/pelit.ruut.me" -> (known after apply)
      ~ max_number_of_record_sets = 10000 -> (known after apply)
      ~ name                      = "pelit.ruut.me" -> "games.ruut.me" # forces replacement
      ~ name_servers              = [
          - "ns1-36.azure-dns.com.",
          - "ns2-36.azure-dns.net.",
          - "ns3-36.azure-dns.org.",
          - "ns4-36.azure-dns.info.",
        ] -> (known after apply)
      ~ number_of_record_sets     = 2 -> (known after apply)
      - tags                      = {} -> null
        # (1 unchanged attribute hidden)

      - soa_record {
          - email         = "azuredns-hostmaster.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "pelit.ruut.me." -> null
          - host_name     = "ns1-36.azure-dns.com." -> null
          - minimum_ttl   = 300 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # cloudflare_record.name_servers["ns1-36.azure-dns.com."] will be destroyed
  # (because cloudflare_record.name_servers is not in configuration)
  - resource "cloudflare_record" "name_servers" {
      - allow_overwrite = false -> null
      - created_on      = "2024-02-20T19:38:16.744625Z" -> null
      - hostname        = "pelit.ruut.me" -> null
      - id              = "fd81b73329ea4dc9ee13556eebe644dc" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-02-20T19:38:16.744625Z" -> null
      - name            = "pelit.ruut.me" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "NS" -> null
      - value           = "ns1-36.azure-dns.com" -> null
      - zone_id         = (sensitive value) -> null
    }

  # cloudflare_record.name_servers["ns2-36.azure-dns.net."] will be destroyed
  # (because cloudflare_record.name_servers is not in configuration)
  - resource "cloudflare_record" "name_servers" {
      - allow_overwrite = false -> null
      - created_on      = "2024-02-20T19:38:17.006404Z" -> null
      - hostname        = "pelit.ruut.me" -> null
      - id              = "15b87ffe3ca8af5cdcd56b0f80dd35bd" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-02-20T19:38:17.006404Z" -> null
      - name            = "pelit.ruut.me" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "NS" -> null
      - value           = "ns2-36.azure-dns.net" -> null
      - zone_id         = (sensitive value) -> null
    }

  # cloudflare_record.name_servers["ns3-36.azure-dns.org."] will be destroyed
  # (because cloudflare_record.name_servers is not in configuration)
  - resource "cloudflare_record" "name_servers" {
      - allow_overwrite = false -> null
      - created_on      = "2024-02-20T19:38:16.272886Z" -> null
      - hostname        = "pelit.ruut.me" -> null
      - id              = "08d363d1c85792abbb33e0dcda4801a1" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-02-20T19:38:16.272886Z" -> null
      - name            = "pelit.ruut.me" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "NS" -> null
      - value           = "ns3-36.azure-dns.org" -> null
      - zone_id         = (sensitive value) -> null
    }

  # cloudflare_record.name_servers["ns4-36.azure-dns.info."] will be destroyed
  # (because cloudflare_record.name_servers is not in configuration)
  - resource "cloudflare_record" "name_servers" {
      - allow_overwrite = false -> null
      - created_on      = "2024-02-20T19:38:16.523875Z" -> null
      - hostname        = "pelit.ruut.me" -> null
      - id              = "ec2ff484c2e20d660ebfba8e705d517b" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-02-20T19:38:16.523875Z" -> null
      - name            = "pelit.ruut.me" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "NS" -> null
      - value           = "ns4-36.azure-dns.info" -> null
      - zone_id         = (sensitive value) -> null
    }

Plan: 1 to add, 0 to change, 5 to destroy.

Changes to Outputs:
  ~ ns             = [
      - "ns1-36.azure-dns.com.",
      - "ns2-36.azure-dns.net.",
      - "ns3-36.azure-dns.org.",
      - "ns4-36.azure-dns.info.",
    ] -> (known after apply)
```
</details>